---
kind: type
id: T:Autodesk.Revit.DB.PrintSetup
source: html/9dc30afc-373c-a532-6c89-ff3fa2b3ceed.htm
---
# Autodesk.Revit.DB.PrintSetup

Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

## Syntax (C#)
```csharp
public class PrintSetup : APIObject
```

## Remarks
The Print Setup object can only get from PrintManager object.